       02 KontoID     PIC X(10) VALUE SPACES.
       02 KundeID     PIC X(10) VALUE SPACES.
       02 Konto-Type  PIC X(20) VALUE SPACES.
       02 Balance     PIC 9(10)V99 VALUE ZEROS.
       02 ValutaKode  PIC X(3) VALUE SPACES.