       02 KundeID       PIC X(20) VALUE SPACES.
       02 Fornavn       PIC X(20) VALUE SPACES.
       02 Efternavn     PIC X(20) VALUE SPACES.
           
