       02 KundeID       PIC X(20) VALUE SPACES.
       02 Fornavn       PIC X(20) VALUE SPACES.
       02 Efternavn     PIC X(20) VALUE SPACES.
       02 KontoInfo.
           03 KontoNummer PIC X(20) VALUE SPACES.
           03 Balance     PIC 9(7)V99 VALUE ZEROS.
           03 ValutaKode  PIC X(3) VALUE SPACES.
